app/models/installation.rb

SELECT "installations".* FROM "installations" ORDER BY "installations"."id" ASC LIMIT 1
---
  def self.current
    order(:id).first || new